package cn.pinghu.springboot_web_jsp;

import org.junit.Test;

/**
 *  自由测试
 * @author shenkai
 * @date 2019/3/25
 */
public class FreeTest {

    /**
     * 从前，村里有一个孝顺媳妇叫阿香，对待婆婆就像对待亲生母亲一样。
     * 阿香的丈夫叫锤子，是一个老实巴交的庄稼人。
     *
     * 　　有一年夏天，婆婆得了病，不能走路，天天待在屋子里。
     * 白天大家都很忙，阿香没有太多时间陪伴婆婆，不过一吃过晚饭，
     * 阿香就来到婆婆跟前陪她说笑，为她按肩。婆婆有一个爱好
     * ，别人喜欢晒太阳，她却喜欢看月亮。有月亮的晚上
     * ，阿香常常抱婆婆出来，让她坐在柔软舒适的藤椅上，
     * 两人一起看月亮。有时婆婆会讲一些月亮的传说，阿
     * 香就凑近婆婆听她讲。有了阿香的陪伴和照顾，婆婆生活得既方便又开心。
     *
     * 　　阿香对婆婆的好，天上的月亮都看在眼里。有一回，
     * 月亮给阿香托了一个梦，告诉她说自己是用金子做成的，
     * 如果阿香需要用钱，可以在月圆之夜端一盆井水出来，
     * 对着月亮，念一声“水镜打开，月亮下来”，
     * 耐心地等待一刻钟，月亮就会出现在水盆里。到时阿香就可以拿出月亮
     * ，从上面锉下一些金子碎屑。阿香担心这样锉来锉去，
     * 月亮会不会变薄了？万一锉坏了，人们就再也见不到美丽圆满的月亮了。
     * 月亮微笑着对阿香说，阴晴圆缺对它来说是常事，不要为它担忧。
     *
     * 　　阿香醒来后并没有把这个梦放在心上，
     * 直到有一天，她的丈夫锤子在外边得罪了邻村的一个恶少。
     * 恶少竟然把锤子软禁起来，然后派人捎话给阿香，要她拿赎金救人，
     * 期限是三天，超过期限，就会先送来一根锤子的手指头。阿香一听
     * ，急得像热锅上的蚂蚁，因为家里早已没有钱了，亲戚邻居都是穷人，
     * 在这么短的时间里也借不到足够的赎金。
     *
     * 　　这可怎么办？阿香不想惊动婆婆，一个人躲在角落里抹眼泪。这
     * 天夜里，阿香好不容易睡着了，月亮又给她托了一个梦，
     * 让她从月亮身上锉一些金子救急。梦醒后，阿香半信半疑，但
     * 她想不出更好的办法。第二天晚上，婆婆睡着了，阿香
     * 为婆婆盖好被子，走出屋子，在月亮下面发了一会儿呆，
     * 无奈之下便开始按照梦里的情形来接月亮。
     *
     * 　　阿香端出一盆洁净的井水放在院子里的供桌上，施了礼，闭上眼睛默念一声“水镜打开，月亮下来”。院子里十分安静，阿香等了又等，觉得时间差不多了，睁开眼睛一看，水盆里果真躺着一个又圆又大的金色月亮，而天上的月亮不见了，夜色显得非常黑。
     *
     * 　　阿香取出月亮，用干净的毛巾擦干月亮身上的水，
     * 抱着它来到屋里，点亮灯，开始用钢锉一下一下地锉月亮。阿
     * 香一边锉月亮，一边流眼泪，心疼月亮为她所做的牺牲。
     * 等锉下的金子碎屑聚成一小堆，差不多够赎回丈夫时，
     * 阿香丢下钢锉，擦干净月亮，轻轻地把它放进水盆里，
     *
     * 闭着眼睛默念一句“水镜打开，月亮上去”。等阿香睜开眼睛，月亮又重新
     * 出现在夜空，看上去几乎没有什么变化，仍旧又圆又大，像金子一样黄澄澄的。
     *
     * 　　早上，阿香包起从月亮上锉下来的金子，来到首饰店里换成钱，又赶到邻村的恶少家里赎出锤子。
     *
     * 　　锤子被阿香搀扶到家里，仍然惊魂未定。等婆婆睡着后，
     * 锤子问阿香从哪里借了那么多钱，以后可怎么还。
     * 阿香回答说不用还，接着就跟丈夫讲了在月亮身上锉金子的秘密
     * 。锤子搂住阿香，说是她的孝顺善良感动了月亮。夫妻俩来到屋外，向
     * 着又圆又大的金色月亮拜了三拜，感谢月亮的大恩大德。
     *
     * 　　没想到第二天，邻村的那个恶少带着手下来找锤子和阿香的麻烦了
     * 。恶少气势汹汹地踢开院门，来到锤子面前，一把揪住他的领口，说：
     * “赶快老实交代，你们是不是偷了我家的金首饰，害怕露馅，
     * 就把它们锉成碎屑，再拿到首饰店里换成钱？”
     *
     * 　　锤子气得胸口发紧，却说不出一句话。恶少睃了阿香一眼，
     * 又嬉皮笑脸地对锤子说：“只要你肯求我，我可以再饶你一次
     * ，只是你漂亮的老婆要到我家当贴身丫鬟，好好伺候我两年，你说怎么样啊？”
     *
     * 　　听到这里，坐在里屋的婆婆喊了一声，要恶少单独进屋，她
     * 有话跟他讲。原来婆婆无意间听到了阿香跟锤子说的月亮的秘密，
     * 希望用这个秘密交换一家人的平安。
     *
     * 　　恶少听婆婆说完，不由得半信半疑。他让手下都老老实实坐下来，等着月亮升起。
     *
     * 　　终于，月亮从云层里露了出来，虽然没有前两天那么圆，却依旧很大很亮
     * ，颜色也是金黄金黄的。恶少逼着阿香在木盆里倒入刚从井里打来的清水，
     * 又命令她快念月亮托梦给她的那句话。阿香立在院子当中，闭上眼睛，心里请求月亮的
     * 宽恕和帮助，轻声念道：“水镜打开，月亮下来。”
     *
     * 　　时间刚过去一刻钟，夜空刹那间被乌云布满了，天上的月亮
     * 出现在了水盆里。恶少激动得浑身发抖，他迫不及待地把两只手伸进水盆里
     * ，还没等他感觉到什么异常，金黄的月亮就被他捧了出来，还滴滴答答地
     * 淌着水。一个手下掏出布袋，帮恶少把月亮装进布袋，又用绳子牢牢地捆扎住袋口。
     *
     * 　　恶少提着沉甸甸的月亮，对锤子和阿香说：“有了这个金月亮，我暂且饶
     * 过你们。这件事你们不许对任何人提起，否则我会拿钢锉在你们身上锉出两袋碎末来！”
     *
     * 　　锤子见恶少要带走月亮，忍不住就要说话。阿香捏了捏锤子的手，
     * 提来一盏马灯，对恶少说：“我们不会跟其他人说的。等你锉够了金子
     * ，就放月亮回天上去吧，大家都离不开月亮。这个马灯你们用吧，
     * 走路小心，不要摔坏了月亮。”
     *
     * 　　恶少让一个手下接过马灯，自己仍旧提着月亮不松
     *
     * 手。他冷笑了几声，说：“你以为我会用钢锉来慢慢地锉
     * 月亮吗？我要拿利刀来割金子，每月十五我都要狠狠地割月亮一刀。我
     * 再也不会让月亮上天了，不然它只肯听你的话，只会掉进你家的水盆里。”
     *
     * 　　听到这里，锤子不安地瞅着阿香。阿香却没有看锤子一眼，自顾自
     * 地跟恶少讲话：“我还要告诉你一件重要的事情，月亮很胆小，刚刚换
     * 了主人，必须在袋子里待满七天，才会变成你想要的金子。”
     *
     * 　　“七天？我当然有耐心等七天，反正月亮已经归我所有
     * ，以后我要像养宝贝那样养着它。”说完，恶少抓紧装有月亮的布袋，带着手下离开了。
     *
     * 　　锤子急忙问阿香：“他们带走了月亮，我们是不是闯了
     * 大祸？天上没有了月亮，以后该怎么办？”
     *
     * 　　阿香笑了，凑到锤子耳边，悄悄地跟他交代了一些话。
     *
     * 　　七天后，恶少带着手下闯进了锤子和阿香的家。一见锤子
     * ，他就嚷道：“你老婆阿香好狡猾，要我等七天，
     * 原来是等月亮变成月牙儿。月牙儿就像一把锋利的刀，
     * 趁我睡着了，偷偷割破布袋，它、它又飞到天上去了
     * ！我一醒来，就连忙放了水盆，也念了那句咒语，
     * 可是捞到手里的始终是月亮的影子。
     * 今天你们赔我圆月那样大的一块金子，我就饶过你们，否则的话，有你们好受的！”
     *
     * 　　恶少和手下正在吵闹，从外边走进一些陌生人，
     * 他们是县里的公差。这些人一问清楚恶少的名字，
     * 就把他和手下一个一个地绑了起来。恶少还要辩解，公差说：
     * “县令老爷最爱赏月，却连着七天没有看到月亮，
     * 听说就是你把月亮抓走的，现在跟我们去县里把事情说清楚！”
     *
     * 　　恶少一下子泄了气。
     *
     * 　　阿香的婆婆看到恶少他们被绑走的一幕，不
     * 由高兴得流下了眼泪。阿香走过去拉住婆婆的手，说
     * ：“婆婆，放心吧，我叫锤子马上再去一趟县里，这一次，坏人肯定会受到应有的惩罚！”
    */
    @Test
    public  void  test01() {

    }
}
